Catalogs/MRS_КлассыМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_КлассыМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодКлассаСимфони</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриоритетПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/MRS_КлассыМеню/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	// Проверка уникальности КодКлассаСимфони
	Если ЗначениеЗаполнено(КодКлассаСимфони) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Поле1
			|ИЗ
			|	Справочник.MRS_КлассыМеню КАК КлассыМеню
			|ГДЕ
			|	КлассыМеню.КодКлассаСимфони = &КодКлассаСимфони
			|	И КлассыМеню.Ссылка <> &ТекущаяСсылка";
		
		Запрос.УстановитьПараметр("КодКлассаСимфони", КодКлассаСимфони);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			ТекстСообщения = "Код класса Симфони должен быть уникальным!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "КодКлассаСимфони", , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка заполнения реквизитов ТЧ Условия
	НомерСтроки = 0;
	Для Каждого СтрокаУсловия Из Условия Цикл
		
		НомерСтроки = НомерСтроки + 1;
		ПрефиксПути = "Объект.Условия[" + Формат(НомерСтроки - 1, "ЧГ=0") + "].";
		
		Если НЕ ЗначениеЗаполнено(СтрокаУсловия.ВидУсловия) Тогда
			
			ТекстСообщения = СтрШаблон("Не заполнен Вид Условия в строке %1", НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПрефиксПути + "ВидУсловия", , Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаУсловия.Оператор) Тогда
			
			ТекстСообщения = СтрШаблон("Не заполнен Оператор в строке %1", НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПрефиксПути + "Оператор", , Отказ);
			
		КонецЕсли;
		
		// Для операторов "Заполнено" и "НеЗаполнено" значение не требуется
		Если НЕ ЗначениеЗаполнено(СтрокаУсловия.Значение) 
			И СтрокаУсловия.Оператор <> "Заполнено" 
			И СтрокаУсловия.Оператор <> "НеЗаполнено" Тогда
			
			ТекстСообщения = СтрШаблон("Не заполнено Значение в строке %1", НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПрефиксПути + "Значение", , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
